const str = 'test'
const arr = [1,2,3,4]

console.log(arr.length)


//Методы

console.log(str.toUpperCase()) //Привели к верхнему регистру

const fruit = 'Some huyna'
console.log(fruit.indexOf('d'))

//Подобным образом обычно узнается, присутствует ли нужное значение вв переменной или там, где мы его ищем

const logg = 'hello world'
console.log(logg.slice(6,8))
// Подобным методом мы вырезаем кусок значения, которое нам нужно. Первой цифрой мы указываем начало (откуда начиваем вырезать, с какого индекса), вторым значением указываем окончание (где вырезать заканчиваем)

const num = 12.3
console.log(Math.round(num))

//Данным методом мы округляем число до ближайшего целого

const test = '12.3px'
console.log(parseInt(test))
//Тут он обрезает и тут же привожит строку к числовому типу данных

console.log(parseFloat(test))
// Тут не совсем понятно для чего он используется. Загуглить