let num = 20 // Это глобальная переменная
function showFilmsMassage (text) {
    console.log(text)
    let num = 10 // Это локальная переменная
}

showFilmsMassage('Hello world') //Так мы вызываем функцию!
console.log(num)

//Обратить внимание. В скобках функции передаем аргумент. Далее в консоль лог так же вписываем название аргумента. После вызываем функцию и уже там пишем то, что хотим видеть или использовать в качестве аргумента. Если что. гуглим
//Аргументов может быть много.
//Если мы создаем переменную внутри функции, то за граниицами функции мы её вызвать не можем! Такая переменная называется "локальной переменной"


function calc (a,b) {
    return (a+b)
}

console.log(calc(5,7))
console.log(calc(8,7))
console.log(calc(15,7))
//Ту по сути работает как калькулятор. МОжно использовать множество раз

function ret () {
    let num = 50
    return num
}

const anotherNum = ret
console.log(anotherNum)

// Это является еще одной функцией return. Называется возвращение значения на ружу. Мы ничего не задаем в поле аргумента. Только внутри фуенкции. Там же может быть множество кода. А его результат return уже возвращает нам.

// Классификация функций

// 1. FunctionDeclaration

